package lesson1;

public class Task5 {
    public static void znakPint(int a1) {
        if (a1 < 0) {
            System.out.println("число " + a1 + " отрицательное");
        } else {
            System.out.println("число " + a1 + " положительное");
        }
        //Выполнено 5.	Написать метод, которому в качестве параметра передается целое число,
        // метод должен напечатать в консоль, положительное ли число передали или отрицательное.
        // Замечание: ноль считаем положительным числом.
    }
}
